HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDma_reg.h
/** \brief 2968, DMARAM Channel 75 Source Address Register */
#define DMA_CH75_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012968u)
/** Alias (User Manual Name) for DMA_CH75_SADR.
* To use register names with standard convension, please use DMA_CH75_SADR.
*/
#define DMA_SADR075 (DMA_CH75_SADR)

/** \brief 296C, DMARAM Channel 75 Destination Address Register */
#define DMA_CH75_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001296Cu)
/** Alias (User Manual Name) for DMA_CH75_DADR.
* To use register names with standard convension, please use DMA_CH75_DADR.
*/
#define DMA_DADR075 (DMA_CH75_DADR)

/** \brief 2970, DMARAM Channel 75 Address and Interrupt Control Register */
#define DMA_CH75_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012970u)
/** Alias (User Manual Name) for DMA_CH75_ADICR.
* To use register names with standard convension, please use DMA_CH75_ADICR.
*/
#define DMA_ADICR075 (DMA_CH75_ADICR)

/** \brief 2974, DMARAM Channel 75 Configuration Register */
#define DMA_CH75_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012974u)
/** Alias (User Manual Name) for DMA_CH75_CHCFGR.
* To use register names with standard convension, please use DMA_CH75_CHCFGR.
*/
#define DMA_CHCFGR075 (DMA_CH75_CHCFGR)

/** \brief 2978, DMARAM Channel 75 Shadow Address Register */
#define DMA_CH75_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012978u)
/** Alias (User Manual Name) for DMA_CH75_SHADR.
* To use register names with standard convension, please use DMA_CH75_SHADR.
*/
#define DMA_SHADR075 (DMA_CH75_SHADR)

/** \brief 297C, DMARAM Channel 75 Control and Status Register */
#define DMA_CH75_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001297Cu)
/** Alias (User Manual Name) for DMA_CH75_CHCSR.
* To use register names with standard convension, please use DMA_CH75_CHCSR.
*/
#define DMA_CHCSR075 (DMA_CH75_CHCSR)

/** \brief 2980, DMARAM Channel 76 Read Data CRC Register */
#define DMA_CH76_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012980u)
/** Alias (User Manual Name) for DMA_CH76_RDCRCR.
* To use register names with standard convension, please use DMA_CH76_RDCRCR.
*/
#define DMA_RDCRCR076 (DMA_CH76_RDCRCR)

/** \brief 2984, DMARAM Channel 76 Source and Destination Address CRC Register */
#define DMA_CH76_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012984u)
/** Alias (User Manual Name) for DMA_CH76_SDCRCR.
* To use register names with standard convension, please use DMA_CH76_SDCRCR.
*/
#define DMA_SDCRCR076 (DMA_CH76_SDCRCR)

/** \brief 2988, DMARAM Channel 76 Source Address Register */
#define DMA_CH76_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012988u)
/** Alias (User Manual Name) for DMA_CH76_SADR.
* To use register names with standard convension, please use DMA_CH76_SADR.
*/
#define DMA_SADR076 (DMA_CH76_SADR)

/** \brief 298C, DMARAM Channel 76 Destination Address Register */
#define DMA_CH76_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001298Cu)
/** Alias (User Manual Name) for DMA_CH76_DADR.
* To use register names with standard convension, please use DMA_CH76_DADR.
*/
#define DMA_DADR076 (DMA_CH76_DADR)

/** \brief 2990, DMARAM Channel 76 Address and Interrupt Control Register */
#define DMA_CH76_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012990u)
/** Alias (User Manual Name) for DMA_CH76_ADICR.
* To use register names with standard convension, please use DMA_CH76_ADICR.
*/
#define DMA_ADICR076 (DMA_CH76_ADICR)

/** \brief 2994, DMARAM Channel 76 Configuration Register */
#define DMA_CH76_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012994u)
/** Alias (User Manual Name) for DMA_CH76_CHCFGR.
* To use register names with standard convension, please use DMA_CH76_CHCFGR.
*/
#define DMA_CHCFGR076 (DMA_CH76_CHCFGR)

/** \brief 2998, DMARAM Channel 76 Shadow Address Register */
#define DMA_CH76_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012998u)
/** Alias (User Manual Name) for DMA_CH76_SHADR.
* To use register names with standard convension, please use DMA_CH76_SHADR.
*/
#define DMA_SHADR076 (DMA_CH76_SHADR)

/** \brief 299C, DMARAM Channel 76 Control and Status Register */
#define DMA_CH76_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001299Cu)
/** Alias (User Manual Name) for DMA_CH76_CHCSR.
* To use register names with standard convension, please use DMA_CH76_CHCSR.
*/
#define DMA_CHCSR076 (DMA_CH76_CHCSR)

/** \brief 29A0, DMARAM Channel 77 Read Data CRC Register */
#define DMA_CH77_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129A0u)
/** Alias (User Manual Name) for DMA_CH77_RDCRCR.
* To use register names with standard convension, please use DMA_CH77_RDCRCR.
*/
#define DMA_RDCRCR077 (DMA_CH77_RDCRCR)

/** \brief 29A4, DMARAM Channel 77 Source and Destination Address CRC Register */
#define DMA_CH77_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129A4u)
/** Alias (User Manual Name) for DMA_CH77_SDCRCR.
* To use register names with standard convension, please use DMA_CH77_SDCRCR.
*/
#define DMA_SDCRCR077 (DMA_CH77_SDCRCR)

/** \brief 29A8, DMARAM Channel 77 Source Address Register */
#define DMA_CH77_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129A8u)
/** Alias (User Manual Name) for DMA_CH77_SADR.
* To use register names with standard convension, please use DMA_CH77_SADR.
*/
#define DMA_SADR077 (DMA_CH77_SADR)

/** \brief 29AC, DMARAM Channel 77 Destination Address Register */
#define DMA_CH77_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ACu)
/** Alias (User Manual Name) for DMA_CH77_DADR.
* To use register names with standard convension, please use DMA_CH77_DADR.
*/
#define DMA_DADR077 (DMA_CH77_DADR)

/** \brief 29B0, DMARAM Channel 77 Address and Interrupt Control Register */
#define DMA_CH77_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129B0u)
/** Alias (User Manual Name) for DMA_CH77_ADICR.
* To use register names with standard convension, please use DMA_CH77_ADICR.
*/
#define DMA_ADICR077 (DMA_CH77_ADICR)

/** \brief 29B4, DMARAM Channel 77 Configuration Register */
#define DMA_CH77_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129B4u)
/** Alias (User Manual Name) for DMA_CH77_CHCFGR.
* To use register names with standard convension, please use DMA_CH77_CHCFGR.
*/
#define DMA_CHCFGR077 (DMA_CH77_CHCFGR)

