HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDma_reg.h
/** \brief 2AE4, DMARAM Channel 87 Source and Destination Address CRC Register */
#define DMA_CH87_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AE4u)
/** Alias (User Manual Name) for DMA_CH87_SDCRCR.
* To use register names with standard convension, please use DMA_CH87_SDCRCR.
*/
#define DMA_SDCRCR087 (DMA_CH87_SDCRCR)

/** \brief 2AE8, DMARAM Channel 87 Source Address Register */
#define DMA_CH87_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AE8u)
/** Alias (User Manual Name) for DMA_CH87_SADR.
* To use register names with standard convension, please use DMA_CH87_SADR.
*/
#define DMA_SADR087 (DMA_CH87_SADR)

/** \brief 2AEC, DMARAM Channel 87 Destination Address Register */
#define DMA_CH87_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012AECu)
/** Alias (User Manual Name) for DMA_CH87_DADR.
* To use register names with standard convension, please use DMA_CH87_DADR.
*/
#define DMA_DADR087 (DMA_CH87_DADR)

/** \brief 2AF0, DMARAM Channel 87 Address and Interrupt Control Register */
#define DMA_CH87_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AF0u)
/** Alias (User Manual Name) for DMA_CH87_ADICR.
* To use register names with standard convension, please use DMA_CH87_ADICR.
*/
#define DMA_ADICR087 (DMA_CH87_ADICR)

/** \brief 2AF4, DMARAM Channel 87 Configuration Register */
#define DMA_CH87_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AF4u)
/** Alias (User Manual Name) for DMA_CH87_CHCFGR.
* To use register names with standard convension, please use DMA_CH87_CHCFGR.
*/
#define DMA_CHCFGR087 (DMA_CH87_CHCFGR)

/** \brief 2AF8, DMARAM Channel 87 Shadow Address Register */
#define DMA_CH87_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AF8u)
/** Alias (User Manual Name) for DMA_CH87_SHADR.
* To use register names with standard convension, please use DMA_CH87_SHADR.
*/
#define DMA_SHADR087 (DMA_CH87_SHADR)

/** \brief 2AFC, DMARAM Channel 87 Control and Status Register */
#define DMA_CH87_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012AFCu)
/** Alias (User Manual Name) for DMA_CH87_CHCSR.
* To use register names with standard convension, please use DMA_CH87_CHCSR.
*/
#define DMA_CHCSR087 (DMA_CH87_CHCSR)

/** \brief 2B00, DMARAM Channel 88 Read Data CRC Register */
#define DMA_CH88_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B00u)
/** Alias (User Manual Name) for DMA_CH88_RDCRCR.
* To use register names with standard convension, please use DMA_CH88_RDCRCR.
*/
#define DMA_RDCRCR088 (DMA_CH88_RDCRCR)

/** \brief 2B04, DMARAM Channel 88 Source and Destination Address CRC Register */
#define DMA_CH88_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B04u)
/** Alias (User Manual Name) for DMA_CH88_SDCRCR.
* To use register names with standard convension, please use DMA_CH88_SDCRCR.
*/
#define DMA_SDCRCR088 (DMA_CH88_SDCRCR)

/** \brief 2B08, DMARAM Channel 88 Source Address Register */
#define DMA_CH88_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B08u)
/** Alias (User Manual Name) for DMA_CH88_SADR.
* To use register names with standard convension, please use DMA_CH88_SADR.
*/
#define DMA_SADR088 (DMA_CH88_SADR)

/** \brief 2B0C, DMARAM Channel 88 Destination Address Register */
#define DMA_CH88_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B0Cu)
/** Alias (User Manual Name) for DMA_CH88_DADR.
* To use register names with standard convension, please use DMA_CH88_DADR.
*/
#define DMA_DADR088 (DMA_CH88_DADR)

/** \brief 2B10, DMARAM Channel 88 Address and Interrupt Control Register */
#define DMA_CH88_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B10u)
/** Alias (User Manual Name) for DMA_CH88_ADICR.
* To use register names with standard convension, please use DMA_CH88_ADICR.
*/
#define DMA_ADICR088 (DMA_CH88_ADICR)

/** \brief 2B14, DMARAM Channel 88 Configuration Register */
#define DMA_CH88_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B14u)
/** Alias (User Manual Name) for DMA_CH88_CHCFGR.
* To use register names with standard convension, please use DMA_CH88_CHCFGR.
*/
#define DMA_CHCFGR088 (DMA_CH88_CHCFGR)

/** \brief 2B18, DMARAM Channel 88 Shadow Address Register */
#define DMA_CH88_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B18u)
/** Alias (User Manual Name) for DMA_CH88_SHADR.
* To use register names with standard convension, please use DMA_CH88_SHADR.
*/
#define DMA_SHADR088 (DMA_CH88_SHADR)

/** \brief 2B1C, DMARAM Channel 88 Control and Status Register */
#define DMA_CH88_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B1Cu)
/** Alias (User Manual Name) for DMA_CH88_CHCSR.
* To use register names with standard convension, please use DMA_CH88_CHCSR.
*/
#define DMA_CHCSR088 (DMA_CH88_CHCSR)

/** \brief 2B20, DMARAM Channel 89 Read Data CRC Register */
#define DMA_CH89_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B20u)
/** Alias (User Manual Name) for DMA_CH89_RDCRCR.
* To use register names with standard convension, please use DMA_CH89_RDCRCR.
*/
#define DMA_RDCRCR089 (DMA_CH89_RDCRCR)

/** \brief 2B24, DMARAM Channel 89 Source and Destination Address CRC Register */
#define DMA_CH89_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B24u)
/** Alias (User Manual Name) for DMA_CH89_SDCRCR.
* To use register names with standard convension, please use DMA_CH89_SDCRCR.
*/
#define DMA_SDCRCR089 (DMA_CH89_SDCRCR)

/** \brief 2B28, DMARAM Channel 89 Source Address Register */
#define DMA_CH89_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B28u)
/** Alias (User Manual Name) for DMA_CH89_SADR.
* To use register names with standard convension, please use DMA_CH89_SADR.
*/
#define DMA_SADR089 (DMA_CH89_SADR)

/** \brief 2B2C, DMARAM Channel 89 Destination Address Register */
#define DMA_CH89_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B2Cu)
/** Alias (User Manual Name) for DMA_CH89_DADR.
* To use register names with standard convension, please use DMA_CH89_DADR.
*/
#define DMA_DADR089 (DMA_CH89_DADR)

/** \brief 2B30, DMARAM Channel 89 Address and Interrupt Control Register */
#define DMA_CH89_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B30u)
/** Alias (User Manual Name) for DMA_CH89_ADICR.
* To use register names with standard convension, please use DMA_CH89_ADICR.
*/
#define DMA_ADICR089 (DMA_CH89_ADICR)

