HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDma_reg.h
/** \brief 2C8C, DMARAM Channel 100 Destination Address Register */
#define DMA_CH100_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C8Cu)
/** Alias (User Manual Name) for DMA_CH100_DADR.
* To use register names with standard convension, please use DMA_CH100_DADR.
*/
#define DMA_DADR100 (DMA_CH100_DADR)

/** \brief 2C90, DMARAM Channel 100 Address and Interrupt Control Register */
#define DMA_CH100_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C90u)
/** Alias (User Manual Name) for DMA_CH100_ADICR.
* To use register names with standard convension, please use DMA_CH100_ADICR.
*/
#define DMA_ADICR100 (DMA_CH100_ADICR)

/** \brief 2C94, DMARAM Channel 100 Configuration Register */
#define DMA_CH100_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C94u)
/** Alias (User Manual Name) for DMA_CH100_CHCFGR.
* To use register names with standard convension, please use DMA_CH100_CHCFGR.
*/
#define DMA_CHCFGR100 (DMA_CH100_CHCFGR)

/** \brief 2C98, DMARAM Channel 100 Shadow Address Register */
#define DMA_CH100_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C98u)
/** Alias (User Manual Name) for DMA_CH100_SHADR.
* To use register names with standard convension, please use DMA_CH100_SHADR.
*/
#define DMA_SHADR100 (DMA_CH100_SHADR)

/** \brief 2C9C, DMARAM Channel 100 Control and Status Register */
#define DMA_CH100_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C9Cu)
/** Alias (User Manual Name) for DMA_CH100_CHCSR.
* To use register names with standard convension, please use DMA_CH100_CHCSR.
*/
#define DMA_CHCSR100 (DMA_CH100_CHCSR)

/** \brief 2CA0, DMARAM Channel 101 Read Data CRC Register */
#define DMA_CH101_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CA0u)
/** Alias (User Manual Name) for DMA_CH101_RDCRCR.
* To use register names with standard convension, please use DMA_CH101_RDCRCR.
*/
#define DMA_RDCRCR101 (DMA_CH101_RDCRCR)

/** \brief 2CA4, DMARAM Channel 101 Source and Destination Address CRC Register */
#define DMA_CH101_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CA4u)
/** Alias (User Manual Name) for DMA_CH101_SDCRCR.
* To use register names with standard convension, please use DMA_CH101_SDCRCR.
*/
#define DMA_SDCRCR101 (DMA_CH101_SDCRCR)

/** \brief 2CA8, DMARAM Channel 101 Source Address Register */
#define DMA_CH101_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CA8u)
/** Alias (User Manual Name) for DMA_CH101_SADR.
* To use register names with standard convension, please use DMA_CH101_SADR.
*/
#define DMA_SADR101 (DMA_CH101_SADR)

/** \brief 2CAC, DMARAM Channel 101 Destination Address Register */
#define DMA_CH101_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CACu)
/** Alias (User Manual Name) for DMA_CH101_DADR.
* To use register names with standard convension, please use DMA_CH101_DADR.
*/
#define DMA_DADR101 (DMA_CH101_DADR)

/** \brief 2CB0, DMARAM Channel 101 Address and Interrupt Control Register */
#define DMA_CH101_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CB0u)
/** Alias (User Manual Name) for DMA_CH101_ADICR.
* To use register names with standard convension, please use DMA_CH101_ADICR.
*/
#define DMA_ADICR101 (DMA_CH101_ADICR)

/** \brief 2CB4, DMARAM Channel 101 Configuration Register */
#define DMA_CH101_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CB4u)
/** Alias (User Manual Name) for DMA_CH101_CHCFGR.
* To use register names with standard convension, please use DMA_CH101_CHCFGR.
*/
#define DMA_CHCFGR101 (DMA_CH101_CHCFGR)

/** \brief 2CB8, DMARAM Channel 101 Shadow Address Register */
#define DMA_CH101_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CB8u)
/** Alias (User Manual Name) for DMA_CH101_SHADR.
* To use register names with standard convension, please use DMA_CH101_SHADR.
*/
#define DMA_SHADR101 (DMA_CH101_SHADR)

/** \brief 2CBC, DMARAM Channel 101 Control and Status Register */
#define DMA_CH101_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CBCu)
/** Alias (User Manual Name) for DMA_CH101_CHCSR.
* To use register names with standard convension, please use DMA_CH101_CHCSR.
*/
#define DMA_CHCSR101 (DMA_CH101_CHCSR)

/** \brief 2CC0, DMARAM Channel 102 Read Data CRC Register */
#define DMA_CH102_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CC0u)
/** Alias (User Manual Name) for DMA_CH102_RDCRCR.
* To use register names with standard convension, please use DMA_CH102_RDCRCR.
*/
#define DMA_RDCRCR102 (DMA_CH102_RDCRCR)

/** \brief 2CC4, DMARAM Channel 102 Source and Destination Address CRC Register */
#define DMA_CH102_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CC4u)
/** Alias (User Manual Name) for DMA_CH102_SDCRCR.
* To use register names with standard convension, please use DMA_CH102_SDCRCR.
*/
#define DMA_SDCRCR102 (DMA_CH102_SDCRCR)

/** \brief 2CC8, DMARAM Channel 102 Source Address Register */
#define DMA_CH102_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CC8u)
/** Alias (User Manual Name) for DMA_CH102_SADR.
* To use register names with standard convension, please use DMA_CH102_SADR.
*/
#define DMA_SADR102 (DMA_CH102_SADR)

/** \brief 2CCC, DMARAM Channel 102 Destination Address Register */
#define DMA_CH102_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CCCu)
/** Alias (User Manual Name) for DMA_CH102_DADR.
* To use register names with standard convension, please use DMA_CH102_DADR.
*/
#define DMA_DADR102 (DMA_CH102_DADR)

/** \brief 2CD0, DMARAM Channel 102 Address and Interrupt Control Register */
#define DMA_CH102_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CD0u)
/** Alias (User Manual Name) for DMA_CH102_ADICR.
* To use register names with standard convension, please use DMA_CH102_ADICR.
*/
#define DMA_ADICR102 (DMA_CH102_ADICR)

/** \brief 2CD4, DMARAM Channel 102 Configuration Register */
#define DMA_CH102_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CD4u)
/** Alias (User Manual Name) for DMA_CH102_CHCFGR.
* To use register names with standard convension, please use DMA_CH102_CHCFGR.
*/
#define DMA_CHCFGR102 (DMA_CH102_CHCFGR)

