HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDma_reg.h
/** \brief 2CD8, DMARAM Channel 102 Shadow Address Register */
#define DMA_CH102_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CD8u)
/** Alias (User Manual Name) for DMA_CH102_SHADR.
* To use register names with standard convension, please use DMA_CH102_SHADR.
*/
#define DMA_SHADR102 (DMA_CH102_SHADR)

/** \brief 2CDC, DMARAM Channel 102 Control and Status Register */
#define DMA_CH102_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CDCu)
/** Alias (User Manual Name) for DMA_CH102_CHCSR.
* To use register names with standard convension, please use DMA_CH102_CHCSR.
*/
#define DMA_CHCSR102 (DMA_CH102_CHCSR)

/** \brief 2CE0, DMARAM Channel 103 Read Data CRC Register */
#define DMA_CH103_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CE0u)
/** Alias (User Manual Name) for DMA_CH103_RDCRCR.
* To use register names with standard convension, please use DMA_CH103_RDCRCR.
*/
#define DMA_RDCRCR103 (DMA_CH103_RDCRCR)

/** \brief 2CE4, DMARAM Channel 103 Source and Destination Address CRC Register */
#define DMA_CH103_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CE4u)
/** Alias (User Manual Name) for DMA_CH103_SDCRCR.
* To use register names with standard convension, please use DMA_CH103_SDCRCR.
*/
#define DMA_SDCRCR103 (DMA_CH103_SDCRCR)

/** \brief 2CE8, DMARAM Channel 103 Source Address Register */
#define DMA_CH103_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CE8u)
/** Alias (User Manual Name) for DMA_CH103_SADR.
* To use register names with standard convension, please use DMA_CH103_SADR.
*/
#define DMA_SADR103 (DMA_CH103_SADR)

/** \brief 2CEC, DMARAM Channel 103 Destination Address Register */
#define DMA_CH103_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CECu)
/** Alias (User Manual Name) for DMA_CH103_DADR.
* To use register names with standard convension, please use DMA_CH103_DADR.
*/
#define DMA_DADR103 (DMA_CH103_DADR)

/** \brief 2CF0, DMARAM Channel 103 Address and Interrupt Control Register */
#define DMA_CH103_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CF0u)
/** Alias (User Manual Name) for DMA_CH103_ADICR.
* To use register names with standard convension, please use DMA_CH103_ADICR.
*/
#define DMA_ADICR103 (DMA_CH103_ADICR)

/** \brief 2CF4, DMARAM Channel 103 Configuration Register */
#define DMA_CH103_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CF4u)
/** Alias (User Manual Name) for DMA_CH103_CHCFGR.
* To use register names with standard convension, please use DMA_CH103_CHCFGR.
*/
#define DMA_CHCFGR103 (DMA_CH103_CHCFGR)

/** \brief 2CF8, DMARAM Channel 103 Shadow Address Register */
#define DMA_CH103_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CF8u)
/** Alias (User Manual Name) for DMA_CH103_SHADR.
* To use register names with standard convension, please use DMA_CH103_SHADR.
*/
#define DMA_SHADR103 (DMA_CH103_SHADR)

/** \brief 2CFC, DMARAM Channel 103 Control and Status Register */
#define DMA_CH103_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CFCu)
/** Alias (User Manual Name) for DMA_CH103_CHCSR.
* To use register names with standard convension, please use DMA_CH103_CHCSR.
*/
#define DMA_CHCSR103 (DMA_CH103_CHCSR)

/** \brief 2D00, DMARAM Channel 104 Read Data CRC Register */
#define DMA_CH104_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D00u)
/** Alias (User Manual Name) for DMA_CH104_RDCRCR.
* To use register names with standard convension, please use DMA_CH104_RDCRCR.
*/
#define DMA_RDCRCR104 (DMA_CH104_RDCRCR)

/** \brief 2D04, DMARAM Channel 104 Source and Destination Address CRC Register */
#define DMA_CH104_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D04u)
/** Alias (User Manual Name) for DMA_CH104_SDCRCR.
* To use register names with standard convension, please use DMA_CH104_SDCRCR.
*/
#define DMA_SDCRCR104 (DMA_CH104_SDCRCR)

/** \brief 2D08, DMARAM Channel 104 Source Address Register */
#define DMA_CH104_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D08u)
/** Alias (User Manual Name) for DMA_CH104_SADR.
* To use register names with standard convension, please use DMA_CH104_SADR.
*/
#define DMA_SADR104 (DMA_CH104_SADR)

/** \brief 2D0C, DMARAM Channel 104 Destination Address Register */
#define DMA_CH104_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D0Cu)
/** Alias (User Manual Name) for DMA_CH104_DADR.
* To use register names with standard convension, please use DMA_CH104_DADR.
*/
#define DMA_DADR104 (DMA_CH104_DADR)

/** \brief 2D10, DMARAM Channel 104 Address and Interrupt Control Register */
#define DMA_CH104_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D10u)
/** Alias (User Manual Name) for DMA_CH104_ADICR.
* To use register names with standard convension, please use DMA_CH104_ADICR.
*/
#define DMA_ADICR104 (DMA_CH104_ADICR)

/** \brief 2D14, DMARAM Channel 104 Configuration Register */
#define DMA_CH104_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D14u)
/** Alias (User Manual Name) for DMA_CH104_CHCFGR.
* To use register names with standard convension, please use DMA_CH104_CHCFGR.
*/
#define DMA_CHCFGR104 (DMA_CH104_CHCFGR)

/** \brief 2D18, DMARAM Channel 104 Shadow Address Register */
#define DMA_CH104_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D18u)
/** Alias (User Manual Name) for DMA_CH104_SHADR.
* To use register names with standard convension, please use DMA_CH104_SHADR.
*/
#define DMA_SHADR104 (DMA_CH104_SHADR)

/** \brief 2D1C, DMARAM Channel 104 Control and Status Register */
#define DMA_CH104_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D1Cu)
/** Alias (User Manual Name) for DMA_CH104_CHCSR.
* To use register names with standard convension, please use DMA_CH104_CHCSR.
*/
#define DMA_CHCSR104 (DMA_CH104_CHCSR)

/** \brief 2D20, DMARAM Channel 105 Read Data CRC Register */
#define DMA_CH105_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D20u)
/** Alias (User Manual Name) for DMA_CH105_RDCRCR.
* To use register names with standard convension, please use DMA_CH105_RDCRCR.
*/
#define DMA_RDCRCR105 (DMA_CH105_RDCRCR)

/** \brief 2D24, DMARAM Channel 105 Source and Destination Address CRC Register */
#define DMA_CH105_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D24u)
/** Alias (User Manual Name) for DMA_CH105_SDCRCR.
* To use register names with standard convension, please use DMA_CH105_SDCRCR.
*/
#define DMA_SDCRCR105 (DMA_CH105_SDCRCR)

/** \brief 2D28, DMARAM Channel 105 Source Address Register */
#define DMA_CH105_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D28u)
/** Alias (User Manual Name) for DMA_CH105_SADR.
* To use register names with standard convension, please use DMA_CH105_SADR.
*/
#define DMA_SADR105 (DMA_CH105_SADR)

/** \brief 2D2C, DMARAM Channel 105 Destination Address Register */
#define DMA_CH105_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D2Cu)
/** Alias (User Manual Name) for DMA_CH105_DADR.
* To use register names with standard convension, please use DMA_CH105_DADR.
*/
#define DMA_DADR105 (DMA_CH105_DADR)

/** \brief 2D30, DMARAM Channel 105 Address and Interrupt Control Register */
#define DMA_CH105_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D30u)
/** Alias (User Manual Name) for DMA_CH105_ADICR.
* To use register names with standard convension, please use DMA_CH105_ADICR.
*/
#define DMA_ADICR105 (DMA_CH105_ADICR)

/** \brief 2D34, DMARAM Channel 105 Configuration Register */
#define DMA_CH105_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D34u)
/** Alias (User Manual Name) for DMA_CH105_CHCFGR.
* To use register names with standard convension, please use DMA_CH105_CHCFGR.
*/
#define DMA_CHCFGR105 (DMA_CH105_CHCFGR)

